#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + additional_zones            = (known after apply)
      + cluster_ipv4_cidr           = (known after apply)
      + default_max_pods_per_node   = 110
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = false
      + enable_tpu                  = (known after apply)
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + instance_group_urls         = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + min_master_version          = "1.16.9-gke.2"
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "resume"
      + network                     = "projects/badamscka/global/networks/resume"
      + node_locations              = [
          + "us-central1-a",
          + "us-central1-b",
          + "us-central1-f",
        ]
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + project                     = "badamscka"
      + region                      = (known after apply)
      + remove_default_node_pool    = false
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "projects/badamscka/regions/us-central1/subnetworks/us-central1-01"
      + zone                        = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = false
            }

          + http_load_balancing {
              + disabled = true
            }

          + kubernetes_dashboard {
              + disabled = (known after apply)
            }

          + network_policy_config {
              + disabled = false
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = (known after apply)

          + auto_provisioning_defaults {
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "us-central1-01-gke-01-pods"
          + node_ipv4_cidr_block          = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "us-central1-01-gke-01-services"
          + subnetwork_name               = (known after apply)
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "05:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + network_policy {
          + enabled  = true
          + provider = "CALICO"
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count  = 0
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = "default-pool"
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + node_locations      = (known after apply)
          + version             = (known after apply)

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = false
              + service_account   = "terraform@badamscka.iam.gserviceaccount.com"
              + taint             = (known after apply)

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + pod_security_policy_config {
          + enabled = (known after apply)
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }
    }

  # module.gke.google_container_node_pool.pools["default-node-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster             = "resume"
      + id                  = (known after apply)
      + initial_node_count  = 80
      + instance_group_urls = (known after apply)
      + location            = "us-central1"
      + max_pods_per_node   = (known after apply)
      + name                = "default-node-pool"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + project             = "badamscka"
      + region              = (known after apply)
      + version             = (known after apply)
      + zone                = (known after apply)

      + autoscaling {
          + max_node_count = 3
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS"
          + labels            = {
              + "cluster_name"      = "resume"
              + "default-node-pool" = "true"
              + "node_pool"         = "default-node-pool"
            }
          + local_ssd_count   = 0
          + machine_type      = "n1-standard-2"
          + metadata          = {
              + "cluster_name"                    = "resume"
              + "disable-legacy-endpoints"        = "true"
              + "node-pool-metadata-custom-value" = "my-node-pool"
              + "node_pool"                       = "default-node-pool"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = "terraform@badamscka.iam.gserviceaccount.com"
          + tags              = [
              + "gke-resume",
              + "gke-resume-default-node-pool",
              + "default-node-pool",
            ]
          + taint             = (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.gke.google_project_iam_member.cluster_service_account-log_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "badamscka"
      + role    = "roles/logging.logWriter"
    }

  # module.gke.google_project_iam_member.cluster_service_account-metric_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-metric_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "badamscka"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "badamscka"
      + role    = "roles/monitoring.viewer"
    }

  # module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-resourceMetadata-writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "badamscka"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.gke.google_service_account.cluster_service_account[0] must be replaced
-/+ resource "google_service_account" "cluster_service_account" {
      ~ account_id   = "tf-gke-gke-test-1-s8ds" -> "tf-gke-resume-s8ds" # forces replacement
      ~ display_name = "Terraform-managed service account for cluster gke-test-1" -> "Terraform-managed service account for cluster resume"
      ~ email        = "tf-gke-gke-test-1-s8ds@badamscka.iam.gserviceaccount.com" -> (known after apply)
      ~ id           = "projects/badamscka/serviceAccounts/tf-gke-gke-test-1-s8ds@badamscka.iam.gserviceaccount.com" -> (known after apply)
      ~ name         = "projects/badamscka/serviceAccounts/tf-gke-gke-test-1-s8ds@badamscka.iam.gserviceaccount.com" -> (known after apply)
        project      = "badamscka"
      ~ unique_id    = "113603323637178701526" -> (known after apply)
    }

  # module.gke.null_resource.wait_for_cluster[0] will be created
  + resource "null_resource" "wait_for_cluster" {
      + id       = (known after apply)
      + triggers = {
          + "name"       = "resume"
          + "project_id" = "badamscka"
        }
    }

  # module.vpc.module.routes.google_compute_route.route["egress-internet"] will be created
  + resource "google_compute_route" "route" {
      + description      = "route through IGW to access internet"
      + dest_range       = "0.0.0.0/0"
      + id               = (known after apply)
      + name             = "egress-internet"
      + network          = "resume"
      + next_hop_gateway = "default-internet-gateway"
      + next_hop_ip      = (known after apply)
      + next_hop_network = (known after apply)
      + priority         = 1000
      + project          = "badamscka"
      + self_link        = (known after apply)
      + tags             = [
          + "egress-inet",
        ]
    }

  # module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-west1/subnet-01"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp       = (known after apply)
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.10.10.0/24"
      + name                     = "subnet-01"
      + network                  = "resume"
      + private_ip_google_access = false
      + project                  = "badamscka"
      + region                   = "us-west1"
      + secondary_ip_range       = [
          + {
              + ip_cidr_range = "192.168.64.0/24"
              + range_name    = "subnet-01-secondary-01"
            },
        ]
      + self_link                = (known after apply)
    }

  # module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-west1/subnet-02"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp       = (known after apply)
      + description              = "This subnet has a description"
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.10.20.0/24"
      + name                     = "subnet-02"
      + network                  = "resume"
      + private_ip_google_access = true
      + project                  = "badamscka"
      + region                   = "us-west1"
      + secondary_ip_range       = []
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-west1/subnet-03"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp       = (known after apply)
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.10.30.0/24"
      + name                     = "subnet-03"
      + network                  = "resume"
      + private_ip_google_access = false
      + project                  = "badamscka"
      + region                   = "us-west1"
      + secondary_ip_range       = []
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_10_MIN"
          + flow_sampling        = 0.7
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "resume"
      + project                         = "badamscka"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

Plan: 13 to add, 0 to change, 1 to destroy.
```

</details>

*Workflow: `terraform`, Action: `autotuneterraform-github-actions4`, Working Directory: `.`, Workspace: `staging`*
